app/views/comments/addcomment_form.html.erb

<table>
  <% @event.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = 10