app/views/users/show_profile.html.erb

SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 2 AND (stop_date >= date('now'))
---
	<ul>
	<% @user_events = @user.events.find(:all, :conditions => ["stop_date >= date('now')"]) %>