app/views/events/index.html.erb

    <td colspan="3"><%= link_to event.category.name, event.category %></td>
    <td colspan="3"><% event.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "events_tags" ON "tags"."id" = "events_tags"."tag_id" WHERE "events_tags"."event_id" = 3

  <tr>
    <td colspan="3"><% if @current_user && event.users.where(:id => @current_user.id).count == 1 %>
---
SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 1
SELECT COUNT(*) FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 3 AND "users"."id" = 2