app/views/events/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "events_tags" ON "tags"."id" = "events_tags"."tag_id" WHERE "events_tags"."event_id" = 6
---
  <b>Tagi wydarzenia:</b>
  <% @event.tags.each do |tag| %>

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = 10 ORDER BY created_at DESC
---
<p>
	<% comments = @event.comments.order('created_at DESC') %>

SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 1
SELECT COUNT(*) FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 6 AND "users"."id" = 2
---
</p>
<% if @event.users.count > 0 %>

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	<% end %>
	<% if @event.users.where(:id => @current_user.id).count == 1 %>