app/views/tags/show.html.erb

  <b>Wydarzenia które opisuje</b></br>
  <% events=@tag.events.all %>
---
SELECT "events".* FROM "events" INNER JOIN "events_tags" ON "events"."id" = "events_tags"."event_id" WHERE "events_tags"."tag_id" = 39

  		  <% events.each do |event| %>
  	 	 <li> <%= link_to event.name , event %> <% if @current_user && @current_user.events.include?(event) %> - Jestes zapisany na to wydarzenie<% end %></li>
---
SELECT 1 FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 1 AND "events"."id" = 9 LIMIT 1