app/controllers/comments_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "10"]]
---
  def addcomment_form

   	@event = Event.find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "10"]]
INSERT INTO "comments" ("content", "created_at", "difference", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "A ja tak yes siur"], ["created_at", Tue, 05 Jun 2012 16:38:11 UTC +00:00], ["difference", ""], ["event_id", 10], ["updated_at", Tue, 05 Jun 2012 16:38:11 UTC +00:00], ["user_id", 2]]
---
  def addcomment
    @comment = Comment.new(:content => params[:content], :user_id => params[:user_id], :event_id => params[:event_id])
    @event = Event.find(params[:event_id])

    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "15"]]
UPDATE "comments" SET "content" = 'A ja tak yes siur z polską', "difference" = 'Ostatnia edycja: 05-06-2012 18:38 ', "updated_at" = '2012-06-05 16:38:24.191499' WHERE "comments"."id" = 15
---
  def update
    @comment = Comment.find(params[:id])
    @author = @comment.user
    @comment.content = params[:content]
    @time = Time.now.strftime("%d-%m-%Y %H:%M ")
    @comment.difference = "Ostatnia edycja: "
    @comment.difference << @time
    if @current_user.admin && !@author.admin
      @comment.difference << ', Administrator'
    end
    respond_to do |format|
      if @comment.save