app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (stop_date >= date('now')) ORDER BY created_at DESC
---
  def index
    @json = Event.all.to_gmaps4rails

SELECT "users".* FROM "users"
INSERT INTO "events" ("building_number", "category_id", "city", "confirmation", "created_at", "description", "door_number", "gmaps", "latitude", "longitude", "name", "reminded", "start_date", "stop_date", "street", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
	@users = User.all
  	@event = Event.new(params[:event])
    @tags = params[:tags][:tags]
    @tags=@tags.split

    @tags.each do |tag|
    	new_tag = Tag.new(:name => tag)
    	new_tag.save
    	@event.tags << new_tag

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "events" SET "category_id" = 2, "updated_at" = '2012-06-05 16:55:42.517286' WHERE "events"."id" = 2
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 3 LIMIT 1
---
  def find_categories
    @categories=Category.find(:all).map do |category|