app/controllers/tags_controller.rb

  def index
    @tags = Tag.order('name')
---
SELECT "tags".* FROM "tags" ORDER BY name