app/controllers/users_controller.rb

INSERT INTO "users" ("admin", "avatar_url", "created_at", "crypted_password", "email", "login", "moderator", "name", "persistence_token", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "visibilities" ("avatar_url", "created_at", "email", "events", "name", "surname", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    @visibility = Visibility.new(:email => true, :name => true, :surname => true, :avatar_url => true, :events => true, :user_id => @user.id)
    if @user.save

UPDATE "users" SET "surname" = 'Dalachona', "updated_at" = '2012-06-05 18:47:03.171313' WHERE "users"."id" = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])

SELECT "visibilities".* FROM "visibilities" WHERE (user_id = 0) LIMIT 1
INSERT INTO "visibilities" ("avatar_url", "created_at", "email", "events", "name", "surname", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def show_profile
  	if !Visibility.find(:first, :conditions => ["user_id = 0"])
	  @visibility = Visibility.new(:email => true, :name => true, :surname => true, :avatar_url => true, :events => true, :user_id => '0')
	  @visibility.save
  	end
  	if params[:id]
  		@user = User.find(params[:id])